In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'sex' : [1,2,1,3,2,1,],
                  'score' : [5,4,3,4,2,6]})
df

   sex  score
0    1      5
1    2      4
2    1      3
3    3      4
4    2      2
5    1      6

In [2]:
df['sex'].value_counts().sort_index()

1    3
2    2
3    1
Name: sex, dtype: int64

In [3]:
df['score'].value_counts().sort_index()

2    1
3    1
4    2
5    1
6    1
Name: score, dtype: int64

In [5]:
df['sex'] = np.where(df['sex'] == 3, np.nan, df['sex'])
df['score'] = np.where(df['score'] > 5, np.nan, df['score'])
df

   sex  score
0  1.0    5.0
1  2.0    4.0
2  1.0    3.0
3  NaN    4.0
4  2.0    2.0
5  1.0    NaN

In [6]:
df.dropna(subset = ['sex','score'])\
    .groupby('sex')\
    .agg(mean_score = ('score','mean'))

     mean_score
sex
1.0         4.0
2.0         3.0